<?php

$array2D = [
  [101,102,104,105,106],
  [200,201,203,205,300]
];

   $sumAll = 0; //總和(累加)     $sum1=0;
   $tmpSum = 0; //小計1、小計2     $sum2=0;
// $count1 = count($array2D[0]);
// $count2 = count($array2D[1]);

/*
    兩層巢狀loop跑的過程依序是這樣：

    外圈(第1圈)： 5圈(內圈)
    $i=0、$c=0 取值 101 二維陣列寫法就是 $array2D[0][0]
    $i=0、$c=1 取值 102 二維陣列寫法就是 $array2D[0][1]
    $i=0、$c=2 取值 104 二維陣列寫法就是 $array2D[0][2]
    $i=0、$c=3 取值 105 二維陣列寫法就是 $array2D[0][3]
    $i=0、$c=4 取值 106 二維陣列寫法就是 $array2D[0][4]

    外圈(第2圈)： 5圈(內圈)
    $i=1、$c=0 取值 200 二維陣列寫法就是 $array2D[1][0]
    $i=1、$c=1 取值 201 二維陣列寫法就是 $array2D[1][1]
    $i=1、$c=2 取值 203 二維陣列寫法就是 $array2D[1][2]
    $i=1、$c=3 取值 205 二維陣列寫法就是 $array2D[1][3]
    $i=1、$c=4 取值 300 二維陣列寫法就是 $array2D[1][4]

*/

//for ($i=0; $i <$count1 ; $i++) {    //邏輯上有誤，外圈只會跑2圈
for($i=0; $i < count($array2D); $i++){  //第一維陣列(外圈)只有2圈，這裡只會跑2次 (即 $i=0、$i=1 也就是跑 $array2D[0]、$array2D[1] )
    //一維 第1圈 $i=0 (取出$array2D[0]的資料陣列，即[101,102...106])
    //先把$array2D[0]丟給內圈loop跑5圈 (取值、計算)
    echo "第$i 組資料 小計：";

    //for($c = 0; $c < $count2; $c++){    //恰巧是跑5圈，但過程不是你想的那樣...
    $times = count($array2D[$i]);   //次數 (跑幾圈)
    for($c=0; $c < $times; $c++){ //先跑第一維的5圈，即 [101,102...106]
        
        
        $tmpSum += $array2D[$i][$c];    //小計 (依序取出所有數，做累加)

        if ( $c < $times -1 ) {
            echo $array2D[$i][$c] .' + ';
        }else{
            echo $array2D[$i][$c] .' = '.$tmpSum;   //每維陣列最後，輸出小計
        }
    }
    $sumAll += $tmpSum; //總和 (依序累加 小計)
    $tmpSum = 0;    //上一輪小計歸零

    echo '<hr>';
}

// echo $sum1 . "<br>";
// echo $sum2 . "<br>";
echo "總計：$sumAll";

?>